Szturin/STM32--PID-/Driver/Motor.c
#include "stm32f10x.h"                  // Device header
#include <PWM.h>
#include <timer.h>
#include <motor.h>

/*宏定义，方便替换引脚*/
#define	LOGIC_A_1 GPIO_Pin_14
#define	LOGIC_A_2 GPIO_Pin_15

#define	LOGIC_B_1 GPIO_Pin_13
#define	LOGIC_B_2 GPIO_Pin_12

#define PWM_A GPIO_Pin_2
#define PWM_B GPIO_Pin_3

void Motor_PWM_Init(void)
{	
	Motor_GPIO_Init();
	TIM2_PWM_Init(7200-1,1-1);
}

void Motor_SpeedSet(int16_t Speed1,int16_t Speed2)
{
	if(Speed1>0)
	{
		GPIO_SetBits(GPIOB, LOGIC_A_1);
		GPIO_ResetBits(GPIOB, LOGIC_A_2);
		TIM_SetCompare3(TIM2,Speed1);
					
	}
	else
	{
		GPIO_SetBits(GPIOB, LOGIC_A_2);	
		GPIO_ResetBits(GPIOB, LOGIC_A_1);
		TIM_SetCompare3(TIM2,-Speed1);     	
	}
	
	if(Speed2>0)
	{
		GPIO_SetBits(GPIOB, LOGIC_B_1);
		GPIO_ResetBits(GPIOB, LOGIC_B_2);		
		TIM_SetCompare4(TIM2,Speed2);
	}
	else
	{
		GPIO_SetBits(GPIOB, LOGIC_B_2);
		GPIO_ResetBits(GPIOB, LOGIC_B_1);		
		TIM_SetCompare4(TIM2,-Speed2);	
	}
}

void Motor_GPIO_Init()
{	
	GPIO_InitTypeDef GPIO_InitStructure; //结构体类型(已经定义好的） 结构体变量名 ->结构体变量的定义
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	
	//PWM口初始化  //mark:重复初始化结构体会覆盖掉，这里PWM就被逻辑口覆盖掉了，逻辑口改为GPIOB
	GPIO_InitStructure.GPIO_Pin = PWM_A | PWM_B; //TIM1_CH1  TIM1_CH4
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;        //复用推挽输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);//初始化GPIOA口
	
	//正反转控制口初始化1
	GPIO_InitStructure.GPIO_Pin = LOGIC_A_1|LOGIC_A_2|LOGIC_B_1|LOGIC_B_2; //右正反转
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;       //推挽输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);//初始化GPIOB口
	
	GPIO_SetBits(GPIOB, LOGIC_A_1|LOGIC_A_2|LOGIC_B_1|LOGIC_B_2);
}